Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

# Ввод массива 
Ввод массива осуществляется с помощью метода CreateArrayString.
Запрашивается у пользователя количество строк и далее вводится каждая строка.
Введенные строки помещаем в массив путем вызова этого метода.
arraystring = CreateArrayString();


# Поиск строк длина, которых меньше 3 символов или равна 3 символа.
Создаем новый временный массив TempArray длиной равной количеству строк, которое ввел пользователь.
В этот массив помещаем строки длина, которых меньше 3 символов или равна 3 символа и считаем их количество.


# Удаление пустых строк из массива строк, в котором длина строк меньше 3 символов или равна 3 символа.
Удаление пустых строк из массива строк осуществляется методом RemoveStringNull. Он возвращет новый массив, в котором только те строки, длина, которых меньше 3 символов или равна 3 символа.
NewArraystring = RemoveStringNull(TempArray, j);

# Вывод на экран результата.
Console.WriteLine($"[ {string.Join("; ",NewArraystring)}]");